EMS/InformationRegisters/EMS_СообщенияСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>EMS_СообщенияСинхронизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EMS_ПараметрыБаз</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EMS/InformationRegisters/EMS_ОбъектыМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>EMS_ОбъектыМетаданных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выбран</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Иерархический</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолеОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрыБазы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EMS_ПараметрыБаз</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EMS/InformationRegisters/EMS_КодСопоставленияОрганизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>EMS_КодСопоставленияОрганизации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Code</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EMS/Catalogs/EMS_ПараметрыБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>EMS_ПараметрыБаз</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Proxy</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SSL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WSИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>WSИмяСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеУзлаИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EMS/CommonModules/EMS_ПроверкаСинхронизации/Ext/Module.bsl
// Получаем список баз НЗ, обходим в цикле, у них заполнены поля КодОрганизации, НаименованиеУзлаИБ
	// Получаем соответстсвия объектов с разными ГУИДАМИ (СоответствияОбъектовИнформационныхБаз) по узлу ИБ
	// Получаем объекты метаданныхиз EMS_ОбъектыМетаданных с отбором по базе для сравнения, обходим в цикле
		// Получаем данные НЗ по объекту метаданных, передааем в параметрах код сопоставления организации(Обсудить необходимость)
		// Получаем данные локальной базы ВЗ по объекту метаданных
		// Преобразуем ключи для сравнения
		// Проверяем есть ли в выборке локальной ключи из внешней, если нет выводим "В<Л", параметр право в настройках HTTPВыборки
		// Пишем в регистр EMS_СообщенияСинхронизации
		
// Объект не найден в сообщениях в результате ЗначениеИзСтрокиВнутр(Стр);
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
Процедура ВыполнитьСинхронизацию(Отладка = Ложь) Экспорт
	Базы = БазыДляСинхронизации(); 
	НаборЗаписейСообщений = РегистрыСведений.EMS_СообщенияСинхронизации.СоздатьНаборЗаписей();
	Для Каждого База Из Базы Цикл
		Если Отладка Тогда
			Сообщить("=== Начало выборки " + База.Ссылка + " ===");     
		КонецЕсли;
		ДанныеБазы = КонструкторСтруктурыДанныеБазы();
		ДанныеБазы.База = База;
		ДанныеБазы.Отладка = Отладка;
		ДанныеБазы.Соединение = ПолучитьПодключениеHTTPСервер(ДанныеБазы.База);
		ДанныеБазы.КэшТипы = Новый Структура("Наружу, Внутрь", Новый Соответствие, Новый Соответствие);
		Если ДанныеБазы.Соединение = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ДанныеБазы.СоответсвиеОбъектов = СоответствияОбъектовБазы(ДанныеБазы.База); 
		ДанныеБазы.ОбъектыМетаданных = ОбъектыМетаданныхБазы(ДанныеБазы.База);
		Обороты(ДанныеБазы, НаборЗаписейСообщений);  
	КонецЦикла; 
	НаборЗаписейСообщений.Записать();
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СообщитьМассив(Выб)
		Сообщить("Массив (" + Выб.Количество() + ")");
КонецПроцедуры

Процедура Обороты(ДанныеБазы, НаборЗаписейСообщений)
	Для Каждого ОбъектМетаданных Из ДанныеБазы.ОбъектыМетаданных Цикл 
		Рез = Новый Массив;
		Если ДанныеБазы.Отладка Тогда
			Сообщить("=== Метаданные " + ОбъектМетаданных.Вид + " ==="); 
		КонецЕсли;
		Попытка
			соРазница =  ОборотыОбъект(ДанныеБазы, ОбъектМетаданных, НаборЗаписейСообщений);
			ОбъединитьРез(соРазница, Рез, ОбъектМетаданных.Тип); 
		Исключение
		КонецПопытки;  
		Если ДанныеБазы.Отладка Тогда
			СообщитьМассив(Рез);
		КонецЕсли;
	КонецЦикла;  
КонецПроцедуры

Функция ОборотыОбъект(ДанныеБазы, ОбъектМетаданных, НаборЗаписейСообщений)  
	База = ДанныеБазы.База;
	СчетКод="";
	Результат = "Выборка";
	Режим="Разница";  
	Рез = Новый Структура;
	Если  ОбъектМетаданных.Тип = "РегистрыРасчета" Тогда 
		Шаблон = ПолучитьШаблонЗапроса(СчетКод,"зуп");
		Текст = СтрЗаменить(Шаблон, "&Условие", " Где ГоловнаяОрганизация В ИЕРАРХИИ (&Организация)"); 
		Поля =  СтрРазделить("Регистратор,Сотрудник,ФизическоеЛицо,ГоловнаяОрганизация,СторноТекущегоПериода,Результат",",",Ложь);
		Рез.Вставить("мИзмерения", Поля);
		Рез.Вставить("ЗапросТекст", Текст);  
		Рез.Вставить("Тип", "РегистрыРасчета");
	Иначе 
		Рез   =   ОбъектыВыборкаОтбор(ОбъектМетаданных); 
		Поля  =   Рез.мИзмерения;
		Текст =   Рез.ЗапросТекст;
	КонецЕсли;
	
	ЗапросПараметры = Новый Структура;
	ЗапросПараметры.Вставить("Организация", База.КодОрганизации);  
	ЗапросПараметры.Вставить("НачалоПериода", '00010101');
	ЗапросПараметры.Вставить("КонецПериода" , '39990101');
	
	Если Рез.Тип = "РегистрБухгалтерии" Или Рез.Тип = "РегистрНакопления" или Рез.Тип = "РегистрыРасчета"  Тогда
		ИнРег = Поля.Найти("Регистратор");
	Иначе  
		ИнРег = Неопределено;  
	КонецЕсли;
	соРазница = ПолучитьРезультат(Текст, Поля, ЗапросПараметры, ИнРег, Рез, ДанныеБазы, ОбъектМетаданных, НаборЗаписейСообщений);
	
	Если ИнРег = Неопределено  Тогда
		Рез.Вставить("Выборка", соРазница);
		Если Рез.Тип = "РегистрыСведений" Тогда 	
			МассивИзВыборки(Рез, ДанныеБазы); 
			Возврат Рез.Результат;
		КонецЕсли;
	КонецЕсли;
	
	Возврат соРазница

КонецФункции

Функция ПолучитьРезультат(Текст, Поля, ЗапросПараметры, Индекс, Рез, ДанныеБазы, ОбъектМетаданных, НаборЗаписейСообщений)
 
	Локал = ВыполнитьЗапрос(Текст, Поля, ЗапросПараметры, ДанныеБазы);
	Внешн = ВыполнитьЗапросВнешний(Текст, Поля, ЗапросПараметры, Истина, ДанныеБазы);
	
	ИнСбк1 = Поля.Найти("ИдентификаторЗаписи");
	соЛокал = ПолучитьКлючиСтр(Локал, ИнСбк1);
	соВнешн = ПолучитьКлючиСтр(Внешн, ИнСбк1);
	Выборка = ПолучитьРазницуПоКлючам(соЛокал, соВнешн, Индекс, ДанныеБазы, ОбъектМетаданных, НаборЗаписейСообщений);
	Если Рез.Тип = "Справочники" или Рез.Тип = "Документы" или  Индекс <> Неопределено Тогда
		Возврат СтуктураВИзСтрокиВнутрНорм(Выборка);
	Иначе 
		Возврат Выборка;	
	КонецЕсли;
		
КонецФункции

Функция ВыполнитьЗапросВнешний(ЗапросТекст, Поля, ЗапросПараметры, АдаптироватьПоСоответствиям, ДанныеБазы)
	
	ЗапросПараметрыВнешний = СтуктураВИзСтрокиВнутр(ЗапросПараметры, Истина);
	
	ДанныеЗапроса = Новый Структура();   
	ДанныеЗапроса.Вставить("ЗапросПараметры",ЗапросПараметры);
	ДанныеЗапроса.Вставить("ЗапросТекст",ЗапросТекст); 
	ДанныеЗапроса.Вставить("Поля",Поля);
	
	Путь = "";
	Рез  = ЗапросКБазеПриемнику(ДанныеБазы, "V1/Список", ДанныеЗапроса, Путь);
	Выб  = Рез[0];
	мТипы = новый Соответствие;
	тВыб = Рез[1]; 
	Для каждого стр Из тВыб Цикл
		мТипы.Вставить( стр[0], стр[1]);
	КонецЦикла;
	
	мРезультат = Новый Массив;
	Для Каждого ТекСтр Из Выб Цикл
		мСтр = Новый Массив;
		Для Каждого Зн Из ТекСтр Цикл
			мСтр.Добавить(Зн);
		КонецЦикла;
		мРезультат.Добавить(мСтр);
	КонецЦикла;     
	мРезультат = АдаптироватьHTTP(мРезультат, Ложь, ДанныеБазы.СоответсвиеОбъектов.ЛокальнаяВоВнешнюю, ДанныеБазы.КэшТипы.Внутрь,мТипы);
	
	Возврат мРезультат;
КонецФункции  

Функция КонструкторСтруктурыДанныеБазы()
	Возврат Новый Структура("Соединение, База, СоответсвиеОбъектов, ОбъектыМетаданных, КэшТипы, Отладка");	
КонецФункции

#Область ПолучениеДанных
   
Функция БазыДляСинхронизации()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EMS_ПараметрыБаз.Proxy КАК Proxy,
		|	EMS_ПараметрыБаз.SSL КАК SSL,
		|	EMS_ПараметрыБаз.WSИмяБазы КАК WSИмяБазы,
		|	EMS_ПараметрыБаз.WSИмяСервера КАК WSИмяСервера,
		|	EMS_ПараметрыБаз.КодОрганизации КАК КодОрганизации,
		|	EMS_ПараметрыБаз.НаименованиеУзлаИБ КАК НаименованиеУзлаИБ,
		|	EMS_ПараметрыБаз.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.EMS_ПараметрыБаз КАК EMS_ПараметрыБаз
		|ГДЕ
		|	EMS_ПараметрыБаз.КодОрганизации <> """"
		|	И EMS_ПараметрыБаз.НаименованиеУзлаИБ <> """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Логин = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("СинхронизацияEMS", "Логин");
	Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("СинхронизацияEMS", "Пароль");
	Базы = Новый Массив;
	Пока Выборка.Следующий() Цикл
		БазаДляСинхронизации = КонструкторСтруктурыБазыДляСинхронизации();
		ЗаполнитьЗначенияСвойств(БазаДляСинхронизации, Выборка);  
		БазаДляСинхронизации.WSИмяПользователя = Логин;
		БазаДляСинхронизации.WSПароль = Пароль;
		Базы.Добавить(БазаДляСинхронизации);
	КонецЦикла;
	Возврат Базы;	
КонецФункции                  

Функция КонструкторСтруктурыБазыДляСинхронизации()
	Возврат Новый Структура("Proxy, SSL, WSИмяБазы, WSИмяПользователя, WSИмяСервера, WSПароль, КодОрганизации, НаименованиеУзлаИБ, Ссылка");	
КонецФункции 

Функция СоответствияОбъектовБазы(База)
	
	Запрос = Новый Запрос;
	Запрос.Текст =   "ВЫБРАТЬ
	|	СоответствияОбъектовИнформационныхБаз.ТипИсточника КАК ТипИсточника,
	|	СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника КАК УникальныйИдентификаторПриемника,
	|	СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточникаСтрокой КАК УникальныйИдентификаторИсточника
	|ИЗ
	|	РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
	|ГДЕ
	|	СоответствияОбъектовИнформационныхБаз.УзелИнформационнойБазы.Наименование = &НаименованиеУзлаИБ
	|	И СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника <> СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточникаСтрокой";
	
	
	Запрос.УстановитьПараметр("НаименованиеУзлаИБ", База.НаименованиеУзлаИБ);
	Выборка = Запрос.Выполнить().Выбрать();
	мИзмерения = СтрРазделить("ТипИсточника, УникальныйИдентификаторПриемника, УникальныйИдентификаторИсточника", ", ", Ложь); 
	мРезультат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Стр = Новый Массив;
		Для Каждого Изм Из мИзмерения Цикл
			Если ТипЗнч(Выборка[Изм]) = Тип("УникальныйИдентификатор") Тогда
				Зн = Строка(Выборка[Изм]);
				Стр.Добавить(ЗначениеВСтрокуВнутр(Зн));	
			Иначе 	
				Стр.Добавить(ЗначениеВСтрокуВнутр(Выборка[Изм]));
				
			КонецЕсли;
		КонецЦикла;
		мРезультат.Добавить(Стр);
	КонецЦикла; 
	
	Результат = Новый Массив;
	Для Каждого эл Из мРезультат Цикл
		Стр = Новый Массив;
		ТипСтр  =    ЗначениеИзСтрокиВнутр(эл[0]);
		СтрокаПриемник =   ЗначениеИзСтрокиВнутр(эл[1]);
		СтрокаПриемникВнутр = СтрокаИзУИД(ТипСтр, СтрокаПриемник);    
		Стр.Добавить(СтрокаПриемникВнутр); 
		СтрокаИсточник =   ЗначениеИзСтрокиВнутр(эл[2]);  
		СтрокаИсточникВнутр = СтрокаИзУИД(ТипСтр, СтрокаИсточник);    
		Стр.Добавить(СтрокаИсточникВнутр);
		Результат.Добавить(Стр);
	КонецЦикла;  
	
	СоответствияОбъектовИнформационныхБаз = Новый Структура("ВнешняяВЛокальную, ЛокальнаяВоВнешнюю", Новый Соответствие, Новый Соответствие);
	Для каждого мСтр Из Результат  Цикл		
		Внешн = мСтр[1];
		Локал = мСтр[0];
		
		СоответствияОбъектовИнформационныхБаз.ВнешняяВЛокальную.Вставить(Внешн, Локал);
		СоответствияОбъектовИнформационныхБаз.ЛокальнаяВоВнешнюю.Вставить(Локал, Внешн);
	КонецЦикла; 
	
	Возврат СоответствияОбъектовИнформационныхБаз;
	
КонецФункции

Функция СтрокаИзУИД(ТипСтр, УИД)
    Тип = Тип(ТипСтр);
    
    СтрПустое = ЗначениеВСтрокуВнутр(XMLЗначение(Тип, "00000000-0000-0000-0000-000000000000"));
    
    Стр = УИД;
    // 123456789012345678901234567890123456
    // 1435823d-b0b3-11ec-9871-0050568d2260
    // 98710050568d226011ecb0b31435823d
    Стр = ""
        + Сред(Стр, 20,  4)
        + Сред(Стр, 25, 12)
        + Сред(Стр, 15,  4)
        + Сред(Стр, 10,  4)
        + Сред(Стр,  1,  8)
    ;
    Стр = СтрЗаменить(СтрПустое, "00000000000000000000000000000000", Стр);
    
    Возврат Стр;
КонецФункции

Функция ОбъектыМетаданныхБазы(База)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	EMS_ОбъектыМетаданных.ОбъектМетаданных КАК Тип,
	|	EMS_ОбъектыМетаданных.Вид КАК Вид,
	|	EMS_ОбъектыМетаданных.ПолеОрганизации КАК ПолеОрганизации
	|ИЗ
	|	РегистрСведений.EMS_ОбъектыМетаданных КАК EMS_ОбъектыМетаданных
	|ГДЕ
	|	EMS_ОбъектыМетаданных.ПараметрыБазы = &ПараметрыБазы
	|	И EMS_ОбъектыМетаданных.Выбран";
	
	Запрос.УстановитьПараметр("ПараметрыБазы", База.Ссылка); 
	Выборка = Запрос.Выполнить().Выбрать();
	ОбъектыМетаданных = Новый Массив;
	Пока Выборка.Следующий() Цикл
		ОбъектМетаданных = КонструкторСтруктурыОбъектыМетаданныхДляБазы();
		ЗаполнитьЗначенияСвойств(ОбъектМетаданных, Выборка);
		ОбъектыМетаданных.Добавить(ОбъектМетаданных);
	КонецЦикла; 
	Возврат ОбъектыМетаданных;
КонецФункции 

Функция КонструкторСтруктурыОбъектыМетаданныхДляБазы()
	Возврат Новый Структура("Тип, Вид, ПолеОрганизации");	
КонецФункции
#КонецОбласти 

#Область HTTPИнтеграция
 Функция ЗапросКБазеПриемнику(ДанныеБазы, ИмяКоманды, ДанныеЗапроса, ПутьНаСервере)
	 База = ДанныеБазы.База;
	 ПутьНаСервере = База.WSИмяБазы + "/hs/sverka/V1/Обороты";
	 //Соединение = ПолучитьПодключениеHTTPСервер(База);
	 
	 Заголовки = Новый Соответствие;
	 Заголовки.Вставить("Content-Type", "application/json;charset=UTF-8");
	 
	 Запрос = Новый HTTPЗапрос(ПутьНаСервере, Заголовки);
	 Запрос.УстановитьТелоИзСтроки(JSON(ДанныеЗапроса, Ложь), "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);   
	 
	 Ответ = ДанныеБазы.Соединение.ОтправитьДляОбработки(Запрос);	
	 Если Ответ.КодСостояния = 200 Тогда
		 
		 ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
		 
		 Попытка
			 ДанныеОтвета = unJSON(ТекстОтвета);
		 Исключение        
			 Коммментарий = СтрШаблон("Ошибка получения структуры из json. Причина: %1%2Данные ответа: %3", 
			 	ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), Символы.ПС, ДанныеОтвета);
			 ЗаписьЖурналаРегистрации(НСтр("ru = 'Проверка синхронизации данных. Разбор JSON'", ОбщегоНазначения.КодОсновногоЯзыка()),
			 УровеньЖурналаРегистрации.Ошибка, , База.Ссылка, Коммментарий); 
			 ВызватьИсключение;
		 КонецПопытки;
		 
		 Возврат ДанныеОтвета;
		 
	 ИначеЕсли Ответ.КодСостояния = 302 или Ответ.КодСостояния = 301 Тогда 
		 НовыйАдрес = Ответ.Заголовки.Получить("Location"); 
	 Иначе        
		 Коммментарий = СтрШаблон("Не удалось выполнить запрос веб-сервиса. Код ответа: %1", Ответ.КодСостояния);
		 ЗаписьЖурналаРегистрации(НСтр("ru = 'Проверка синхронизации данных. Код состояния'", ОбщегоНазначения.КодОсновногоЯзыка()),
		 УровеньЖурналаРегистрации.Ошибка, , База.Ссылка, Коммментарий);   
		ВызватьИсключение("Не удалось выполнить запрос веб-сервиса.");
	 КонецЕсли;
	 
КонецФункции

Функция JSON(Данные, СОтступами = Истина)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	Если СОтступами Тогда
		ПараметрыJSON = Новый ПараметрыЗаписиJSON(, "	");
	Иначе
		ПараметрыJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	КонецЕсли;
	ЗаписьJSON.УстановитьСтроку(ПараметрыJSON);
	ЗаписатьJSON(ЗаписьJSON, Данные);
	Результат = ЗаписьJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

Функция unJSON(JSONСтрока)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(JSONСтрока);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьПодключениеHTTPСервер(База)  

	Попытка
		ssl = Новый ЗащищенноеСоединениеOpenSSL();
		Соединение = Новый HTTPСоединение(База.WSИмяСервера, , База.WSИмяПользователя, База.WSПароль, , , ssl);	
	Исключение 
		Коммментарий = СтрШаблон("Ошибка получения http соединения с базой. Причина: %1", ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Проверка синхронизации данных. ПолучитьПодключениеHTTPСервер'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , База.Ссылка, Коммментарий);  
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Соединение;
	
КонецФункции
#КонецОбласти  

#Область ПреобразованияСтрок
 	
Функция СтрокаПустогоЗначения(Знач Тип) 
	Возврат ЗначениеВСтрокуВнутр(ПустоеЗначение(Тип));
КонецФункции

Функция ПустоеЗначение(Знач Тип) 
	Если Тип =  "DocumentRef.Трансляция" или Тип = "DocumentRef.ТрансформационнаяКорректировка" Тогда
	 	Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Тип) = Тип("Строка") Тогда
		ТипСтр = Тип;
		Тип = Тип(Тип);
	Иначе 
		ТипСтр = XMLТип(Тип).ИмяТипа;
	КонецЕсли;
	
	ТипСтр = СтрРазделить(ТипСтр, ".")[0];
	
	Если      ТипСтр = "EnumRef" Тогда
		Возврат XMLЗначение(Тип, "");
	Иначе
		Возврат XMLЗначение(Тип, "00000000-0000-0000-0000-000000000000");
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

Процедура СтрокаВнутрАнализ(СтрВн, Смв = "", Тип = "", Код = "", УИД = "")
	Смв = ""; Тип = ""; Код = ""; УИД = "";
	
	мСтр = СтрРазделить(Сред(СтрВн, 2, СтрДлина(СтрВн) - 2), ",", Истина);
	КолВо = мСтр.Количество();
	
	Смв = Сред(мСтр[0], 2, 1);
	
	Если КолВо < 2 Тогда
		Возврат;
	КонецЕсли;
	
	Тип = мСтр[1];
	
	Если КолВо < 3 Тогда
		Возврат;
	КонецЕсли;
	
	мКодУИД = СтрРазделить(мСтр[2], ":", Истина);
	Код = мКодУИД[0];
	УИД = мКодУИД[1];
КонецПроцедуры

Функция СтрокаВнутрСинтез(Смв, Тип, Код, УИД)
	Возврат "{"
		+ """" + Смв + """" + ","
		+ Тип + ","
		+ Код + ":"
		+ УИД
		+ "}"
	;
КонецФункции

Функция СтрТипЗнч(ЗнчСтр) 
	Знч = ЗначениеИзСтрокиВнутр(ЗнчСтр);
	Тип = ТипЗнч(Знч);
	Возврат XMLТип(Тип).ИмяТипа;
КонецФункции
#КонецОбласти 

#Область АдаптацияДанных
Функция АдаптироватьHTTP(Знач Зн, НаружуИстинаВнутрьЛожь, СоответствияОбъектов, Типы, мТипы)
	Тип = ТипЗнч(Зн);
	Если      Тип = Тип("Структура") Тогда
		Рез = Новый Структура;
		Для Каждого Стр Из Зн Цикл
			Рез.Вставить(Стр.Ключ, АдаптироватьHTTP(Стр.Значение, НаружуИстинаВнутрьЛожь, СоответствияОбъектов, Типы, мТипы));
		КонецЦикла;
		
	ИначеЕсли Тип = Тип("Массив") Тогда
		Рез = Новый Массив;
		Для Каждого Стр Из Зн Цикл
			Рез.Добавить(АдаптироватьHTTP(Стр, НаружуИстинаВнутрьЛожь, СоответствияОбъектов, Типы, мТипы));
		КонецЦикла;
		
	Иначе
		Рез = Зн;
		
		Если НаружуИстинаВнутрьЛожь = Ложь И СоответствияОбъектов <> Неопределено Тогда
			Соо = СоответствияОбъектов.Получить(Рез);
			Если Соо <> Неопределено Тогда
				Рез = Соо;
			КонецЕсли;
		КонецЕсли;
		
		
		Смв = ""; ТипУИД = ""; КодУИД = ""; УИД = "";
		СтрокаВнутрАнализ(Рез, Смв, ТипУИД, КодУИД, УИД);
		
		Если Смв = "#" И УИД <> "" Тогда 
			Пустое = Типы.Получить(ТипУИД);
			Если Пустое = Неопределено Тогда
				Если НаружуИстинаВнутрьЛожь = Истина Тогда 
					ТипСтр = СтрТипЗнч(Рез);
				Иначе
					тТипСтр = мТипы.Получить(ТипУИД); 
					Пустое = СтрокаПустогоЗначения(тТипСтр);
				КонецЕсли;
				Типы.Вставить(ТипУИД, Пустое);
			КонецЕсли;
			
			СтрокаВнутрАнализ(Пустое,, ТипУИД, КодУИД, );
			
			Рез = СтрокаВнутрСинтез(Смв, ТипУИД, КодУИД, УИД);
		КонецЕсли;
	КонецЕсли;
	Возврат Рез;
КонецФункции

Функция СтуктураВИзСтрокиВнутр(Зн, ВИстинаИзЛожь)
	Тип = ТипЗнч(Зн);
	Если      Тип = Тип("Структура") Тогда
		Рез = Новый Структура;
		Для Каждого Стр Из Зн Цикл
			Рез.Вставить(Стр.Ключ, СтуктураВИзСтрокиВнутр(Стр.Значение, ВИстинаИзЛожь));
		КонецЦикла;
	ИначеЕсли Тип = Тип("Массив") Тогда
		Рез = Новый Массив;
		Для Каждого Стр Из Зн Цикл
			Рез.Добавить(СтуктураВИзСтрокиВнутр(Стр, ВИстинаИзЛожь));
		КонецЦикла;
	Иначе
		Рез = ?(ВИстинаИзЛожь, ЗначениеВСтрокуВнутр(Зн), ЗначениеИзСтрокиВнутр(Зн));
	КонецЕсли;
	Возврат Рез;
КонецФункции  

Функция СтуктураВИзСтрокиВнутрНорм(Зн)
		Рез = Новый Массив;
		Для Каждого Стр Из Зн Цикл
			Для Каждого мСтр Из Стр Цикл
				Если мСтр = "{""B"",0}" Тогда
					Продолжить;	
				КонецЕсли;
				Рез.Добавить(ЗначениеИзСтрокиВнутр(мСтр));	
			КонецЦикла;
			
		КонецЦикла;
	Возврат Рез;
КонецФункции

#КонецОбласти

#Область СравнениеКлючей
 
Функция ПолучитьРазницуПоКлючам(соЛокал, соВнешн, Индекс, ДанныеБазы, ОбъектМетаданных, НаборЗаписейСообщений)
	Если ДанныеБазы.Отладка Тогда
		Сообщить("Л " + соЛокал.Количество() + ", В " + соВнешн.Количество()); 
	КонецЕсли;
	соРазница = Новый Соответствие;
	мРазница = Новый Соответствие;  
	мКлючЗаписиРС = Новый Массив;
		Для Каждого Стр Из соВнешн Цикл
			Если соЛокал.Получить(Стр.Ключ) = Неопределено Тогда
				мСтр = Стр.Значение;
				СтрокаНабора = НаборЗаписейСообщений.Добавить();
				СтрокаНабора.Дата = ТекущаяДатаСеанса();
				СтрокаНабора.База = ДанныеБазы.База.Ссылка;
				СтрокаНабора.Вид = ОбъектМетаданных.Вид;
				СтрокаНабора.Тип = ОбъектМетаданных.Тип;
				СтрокаНабора.Сообщение = СообщитьМассивСтрокуЗн(мСтр, "В<Л", ДанныеБазы.Отладка);
				Если Индекс = Неопределено Тогда
				  мКлючЗаписиРС.Добавить(Стр.Значение);      
				Иначе 
				соРазница.Вставить(мСтр[Индекс]);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

	Рез = Новый Массив;
	Для Каждого Стр Из соРазница Цикл
		мСтр = Новый Массив;
		мСтр.Добавить(Стр.Ключ);
		Рез.Добавить(мСтр);
	КонецЦикла; 
	
	Если мКлючЗаписиРС.Количество()>0   Тогда
		 Возврат мКлючЗаписиРС;
	КонецЕсли;
	Если ДанныеБазы.Отладка Тогда
		Сообщить("Разниц: " + Рез.Количество());
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

Функция СообщитьМассивСтрокуЗн(Знач мСтр, Пре, Отладка)
	Сооб = "";
	Сооб = Пре + "|";
	Для Каждого Стр Из мСтр Цикл
		Зн = ЗначениеИзСтрокиВнутр(Стр);
				
		Сооб = Сооб
			+ Зн  + ","
			+ "|"
		;
	КонецЦикла;  
	Если Отладка Тогда
		Сообщить(Сооб);
	КонецЕсли;
	Возврат Сооб;
КонецФункции

Функция ПолучитьКлючиСтр(Внешн, ИнС = Неопределено) 
	соВнешн = Новый Соответствие;
	Для Каждого Стр Из Внешн Цикл
		Ключ = "";   
		сч = 0;
		Для Каждого Зн Из Стр Цикл  
			Если  ИнС = сч Тогда
				Продолжить;	
			КонецЕсли;
			
			Ключ = Ключ + Зн + ","; 
			сч = сч +1;
		КонецЦикла;
		
		соВнешн.Вставить(Ключ, Стр);
	КонецЦикла;
	
	Возврат соВнешн;
КонецФункции
#КонецОбласти    

#Область МетаданныеЗапросы
 
Функция ОбъектыВыборкаОтбор(ОбъектМетаданных) 
	
	Рез = Новый Структура("Тип, Вид", ОбъектМетаданных.Тип, ОбъектМетаданных.Вид);
	
	Если ОбъектМетаданных.Тип = "Справочники" Тогда
		ТипЗапрос = "Справочник";
	ИначеЕсли ОбъектМетаданных.Тип = "Документы" Тогда
		ТипЗапрос = "Документ";
	ИначеЕсли ОбъектМетаданных.Тип = "РегистрыСведений" Тогда
		ТипЗапрос = "РегистрСведений";
	ИначеЕсли ОбъектМетаданных.Тип = "РегистрыНакопления" Тогда
		ТипЗапрос = "РегистрНакопления";
	ИначеЕсли ОбъектМетаданных.Тип = "ПланыВидовХарактеристик" Тогда
		ТипЗапрос = "ПланВидовХарактеристик";
	ИначеЕсли ОбъектМетаданных.Тип = "Последовательности" Тогда
		ТипЗапрос = "Последовательность";
	КонецЕсли;
	
	мИзмерения = МДИзмерения(ОбъектМетаданных.Тип, ОбъектМетаданных.Вид);
	Рез.Вставить("Поля", мИзмерения);
	
	ЗапросТекст = 
		"ВЫБРАТЬ 
		|	" + ?(мИзмерения.Количество() = 0, "1 КАК ПолеВыборки", СтрСоединить(мИзмерения, ", ")) + "
		|ИЗ
		|	" + ТипЗапрос + "." + ОбъектМетаданных.Вид + "
		|";
	
	ЗапросПараметры = Новый Структура;
	ЗапросТекст = ЗапросТекст + ЗапросУсловие(ОбъектМетаданных);
	
	Рез.Вставить("мИзмерения", мИзмерения);
	Рез.Вставить("ЗапросТекст", ЗапросТекст);
	Возврат Рез;
КонецФункции    

Функция МДИзмерения(Тип, Вид, ВыборкаПроведенные = Ложь, ПометкаУдаления = Истина)

	мИзмерения = Новый Массив;
	
	Если      Тип = "Константы" Тогда
	ИначеЕсли Тип = "Справочники" Или Тип = "Документы" Или Тип = "ПланыВидовХарактеристик" Тогда
		
		мИзмерения.Добавить("Ссылка");
		
		Если Тип = "Документы"  Тогда
			Если  ВыборкаПроведенные Тогда
			КонецЕсли;
		КонецЕсли;
		
		Если Тип = "Справочники" Тогда 
		КонецЕсли;
		
	ИначеЕсли Тип = "РегистрыСведений" Тогда
			МД = Метаданные[Тип][Вид];
			Независимый = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый;
			Непериодический = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический;
		
		Для Каждого ТекИзм Из МД.Измерения Цикл
			Если Тип = "РегистрыСведений" И Не ТекИзм.ОсновнойОтбор Тогда
				Продолжить;
			КонецЕсли;
			мИзмерения.Добавить(ТекИзм.Имя);
		КонецЦикла;
		
		Если Не МД.РежимЗаписи = Независимый Тогда
			мИзмерения.Добавить("Регистратор");
		КонецЕсли;
		Если МД.ПериодичностьРегистраСведений <> Непериодический Тогда
			мИзмерения.Добавить("Период");
		КонецЕсли;

		Если мИзмерения.Количество() = 0 Тогда
			Для Каждого ТекИзм Из МД.Измерения Цикл
				мИзмерения.Добавить(ТекИзм.Имя);
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли Тип = "РегистрыНакопления" Тогда
		мИзмерения.Добавить("Регистратор");
		
	ИначеЕсли Тип = "Последовательности" Тогда
		мИзмерения.Добавить("Организация"); 
		мИзмерения.Добавить("Регистратор");
		мИзмерения.Добавить("Период");
		мИзмерения.Добавить("МоментВремени");
		мИзмерения.Добавить("СостояниеПроведения");
		
	КонецЕсли;

	Возврат мИзмерения;
КонецФункции

Функция ЗапросУсловие(ОбъектМетаданных)
	мУсловие = Новый Массив;	
	Если ЗначениеЗаполнено(ОбъектМетаданных.ПолеОрганизации) Тогда
		 мУсловие.Добавить(СтрШаблон("%1 = &Организация", ОбъектМетаданных.ПолеОрганизации));
	КонецЕсли;	
	Если мУсловие.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	Возврат " "
			+ "ГДЕ" + Символы.ПС
			+ СтрСоединить(мУсловие, Символы.ПС + "И ")
			+ Символы.ПС;
КонецФункции

Функция ПолучитьШаблонЗапроса(СчетКод, ВариантаШаблона)
	
	Шаблон = "ВЫБРАТЬ
	|	Начисления.Регистратор КАК Регистратор,
	|	Начисления.Сотрудник КАК Сотрудник,
	|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Начисления.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	Начисления.СторноТекущегоПериода КАК СторноТекущегоПериода,
	|	Начисления.Результат КАК Результат
	|ИЗ
	|	РегистрРасчета.Начисления КАК Начисления
	|	&Условие";
	Возврат Шаблон; 
	
КонецФункции
#КонецОбласти

#Область ОбработкаВыборок
  Процедура МассивИзВыборки(Выб, ДанныеБазы, ИзВнутр = Истина)

	Кол = Выб.Поля.Количество();
	Тип = Выб.Тип; Вид = Выб.Вид;
	Измерения = Выб.Поля;
	сИзмерения = СтрСоединить(Измерения, ",");
	Отбор = Новый Структура(сИзмерения);
	
	Поля = Новый Соответствие; Сч = 0;
	Для Каждого Поле Из Поля Цикл
		Поля.Вставить(Поле, Сч);
		Сч = Сч + 1;
	КонецЦикла;
	
	Если      Тип = "РегистрыСведений" Тогда
		Рег = РегистрыСведений;
	ИначеЕсли Тип = "РегистрыНакопления" Тогда
		Рег = РегистрыНакопления;
	КонецЕсли;
	
	Рез = Новый Массив;
	
	Для Каждого ТекСтр Из Выб.Выборка Цикл
		Если Тип = "Последовательности" Тогда
			Отбор = Новый Структура(сИзмерения);
		КонецЕсли;
		
		Флаг = Ложь;
		
		Для Сч = 0 По Кол - 1 Цикл
			Поле = ТекСтр[Сч];
			Если ИзВнутр Тогда
				Поле = ЗначениеИзСтрокиВнутр(Поле);  
				ПроверкаНаБитуюСсылку(Поле,Флаг, ДанныеБазы);
			КонецЕсли;
			
			Если Тип = "РегистрыСведений"
			 Или Тип = "РегистрыНакопления"
			 Или Тип = "Последовательности"
			Тогда
				Отбор[Измерения[Сч]] = Поле;
			Иначе
				Значение = Поле; 
			КонецЕсли;
		КонецЦикла;
		
		Если Тип = "РегистрыСведений"
		 Или Тип = "РегистрыНакопления"
		Тогда
			Значение = Рег[Вид].СоздатьКлючЗаписи(Отбор);
			Если Тип = "РегистрыСведений" И Вид = "РасчетПоказателейОтложенногоНалога" Тогда
				Значение = Отбор.Регистратор;
			КонецЕсли;
		ИначеЕсли Тип = "Последовательности" Тогда
			Значение = Отбор;
		КонецЕсли;
		
		Если Флаг Тогда
		
			Продолжить;	
		
		КонецЕсли;
		
		Рез.Добавить(Значение);
	КонецЦикла;
	
	Выб.Вставить("Результат", Рез);
КонецПроцедуры

Процедура ПроверкаНаБитуюСсылку(Поле, Флаг, ДанныеБазы) 
	  
	  Попытка
		  Стр = Строка(Поле); 
		  Если СтрНайти(Стр,"<Объект не найден>")>0 Тогда
			  Флаг =  Истина	
		  КонецЕсли;   
	  Исключение       
		  Коммментарий = СтрШаблон("Поле: %1, Флаг: %2, %3", Поле, Флаг, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		  ЗаписьЖурналаРегистрации(НСтр("ru = 'Проверка синхронизации данных. ПроверкаНаБитуюСсылку'", ОбщегоНазначения.КодОсновногоЯзыка()),
		  УровеньЖурналаРегистрации.Ошибка, , ДанныеБазы.База.Ссылка, Коммментарий);   
	  КонецПопытки;   
	  
  КонецПроцедуры
  

Процедура ОбъединитьРез(соРазница, Рез, Тип)
	
	Для каждого эл Из соРазница Цикл
		Если Тип = "РегистрыСведений"  Тогда
			Рез.Добавить(эл);	
		Иначе
			Если эл.ПолучитьОбъект() <> Неопределено Тогда 
				Рез.Добавить(эл);	                               
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ЛокальныеЗапросы
Функция ВыполнитьЗапрос(ЗапросТекст, Поля, ЗапросПараметры, ДанныеБазы)
	База = ДанныеБазы.База;
	Запрос = Новый Запрос;
	Запрос.Текст = ЗапросТекст;
	Для Каждого ТекПар Из ЗапросПараметры Цикл
		Ключ = ТекПар.Ключ;
		Зн = ТекПар.Значение;
		
		Если Ключ = "Организация" И ТипЗнч(Зн) = Тип("Строка") Тогда 
			Зн = Орг(Зн);
		КонецЕсли;
		
		Запрос.УстановитьПараметр(Ключ, Зн);
	КонецЦикла;
	
	Попытка
		Выборка = Запрос.Выполнить().Выбрать();	
	Исключение           
		Коммментарий = СтрШаблон("Ошибка выполнения запроса. Текст: %1%2Причина: %1", ЗапросТекст, Символы.ПС, 
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Проверка синхронизации данных. ВыполнитьЗапрос'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Ошибка, , База.Ссылка, Коммментарий);
	КонецПопытки;
	
	мРезультат = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Стр = Новый Массив;
		Для Каждого Изм Из Поля Цикл
			Зн = Выборка[Изм];
				Если ТипЗнч(Выборка[Изм]) = Тип("УникальныйИдентификатор") Тогда
					Зн1 = Строка(Выборка[Изм]);   
					Зн = ЗначениеВСтрокуВнутр(Зн1);
				Иначе 	
					Зн = ЗначениеВСтрокуВнутр(Зн);
				КонецЕсли;
				
			Стр.Добавить(Зн);
		КонецЦикла;
		мРезультат.Добавить(Стр);
	КонецЦикла;
	
	Возврат мРезультат;
КонецФункции

Функция Орг(Знач ИД)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	EMS_КодСопоставленияОрганизации.ГУИД КАК ГУИД
		|ИЗ
		|	РегистрСведений.EMS_КодСопоставленияОрганизации КАК EMS_КодСопоставленияОрганизации
		|ГДЕ
		|	EMS_КодСопоставленияОрганизации.Code = &Code";
	
	Запрос.УстановитьПараметр("Code", ИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат XMLЗначение(Тип("CatalogRef.Организации"),ВыборкаДетальныеЗаписи.ГУИД); 
	КонецЦикла;
	
 	Возврат Неопределено; 
КонецФункции  

#КонецОбласти
#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
